#include <iostream>
#include <windows.h>
using namespace std;
int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
    int x;
    cout << "Працює інформаційна система факультету прикладної математики:\n";
	cout << "1. Новини дня\n";
	cout << "2. Анекдот тижня\n";
	cout << "3. Автора !!!\n";
	cout << "Введіть відповідний номер і натисніть ENTER. \n";
	cin >> x;
	if (x == 1)
	{
		cout << "Новини дня: Сьогодні гарна погода!\n";
	}
	else if (x == 2)
	{
		cout << "Анекдот тижня: Чому програмісти не люблять природу? Вона має занадто багато багів!\n";
	}
	else if (x == 3)
	{
		cout << "Автор: Стафехін Павло Андрійович, студент ПА-25у-1.\n";
	}
	else
	{
		cout << "Невірний вибір. Будь ласка, спробуйте ще раз.\n";
	}
	return 0;
}